backend/app/controllers/api/v1/bars_controller.rb

  def index
    @bars = Bar.all
---
SELECT "bars".* FROM "bars"

def create
  bar = Bar.create(bar_params)
---
INSERT INTO "bars" ("zip_code", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["zip_code", 11111], ["created_at", "2018-05-10 14:54:35.645851"], ["updated_at", "2018-05-10 14:54:35.645851"]]