backend/app/controllers/api/v1/events_controller.rb

def create
  zip_code = event_params[:zip_code]
  if zip_code.length == 5

    bar_url = "#{API_HOST}#{SEARCH_PATH}"
    params = {
      term: "bars",
      location: zip_code,
      limit: SEARCH_LIMIT
    }

    response = HTTP.auth("Bearer #{API_KEY}").get(bar_url, params: params)
    bar_response = response.parse
    # puts bar_response
    bar_array = bar_response["businesses"]

    bar_array.each do |bar|
      bar_name = bar["name"]
      bar_title = bar["categories"][0]["title"]
      bar_address = bar["location"]["address1"]
      bar_zip_code = bar["location"]["zip_code"]
      bar_price = bar["price"]
      Bar.create(name: bar_name, zip_code: bar_zip_code, address: bar_address, title: bar_title, price: bar_price)
---
INSERT INTO "bars" ("name", "zip_code", "address", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Crimmins Ale House"], ["zip_code", 10310], ["address", "1144 Forest Ave"], ["created_at", "2018-05-10 22:06:27.642210"], ["updated_at", "2018-05-10 22:06:27.642210"], ["title", "Pubs"]]

      restaurant_address = restaurant["location"]["address1"]
      restaurant_zip_code = restaurant["location"]["zip_code"]
      restaurant_price = restaurant["price"]
      Restaurant.create(name: restaurant_name, zip_code: restaurant_zip_code, address: restaurant_address, title: restaurant_title, price: restaurant_price)
---
INSERT INTO "restaurants" ("name", "zip_code", "address", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Garlic Bbq"], ["zip_code", 10302], ["address", "1419 Forest Ave"], ["title", "Barbeque"], ["created_at", "2018-05-10 22:06:28.357024"], ["updated_at", "2018-05-10 22:06:28.357024"]]

      music_address = music["location"]["address1"]
      music_zip_code = music["location"]["zip_code"]
      music_price = music["price"]
      Music.create(name: music_name, zip_code: music_zip_code, address: music_address, title: music_title, price: music_price)
---
INSERT INTO "musics" ("name", "zip_code", "address", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mailroom"], ["zip_code", 10005], ["address", "110 Wall St"], ["title", "Bars"], ["created_at", "2018-05-10 18:57:25.332877"], ["updated_at", "2018-05-10 18:57:25.332877"]]