backend/app/controllers/api/v1/musics_controller.rb

SELECT "musics".* FROM "musics"
---
  def index
    @musics = Music.all